In [1]:
import pandas as pd
import numpy as np

In [6]:
pd.DataFrame(np.random.rand(3, 2),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])

        foo       bar
a  0.855648  0.120089
b  0.324652  0.901508
c  0.367358  0.050349

In [7]:
A = np.zeros(3, dtype=[('A', 'i8'), ('B', 'f8')])

In [8]:
pd.DataFrame(A)
#put A in a pandas dataframe

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

In [10]:
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])

print(indA & indB) # intersection
print(indA | indB) # union
print(indA ^ indB) # symmetric difference

Int64Index([3, 5, 7], dtype='int64')
Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')
Int64Index([1, 2, 9, 11], dtype='int64')

In [2]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [8]:
data.loc[1:5]

1    a
3    b
5    c
dtype: object

In [10]:
data.loc[1:3]

1    a
3    b
dtype: object

In [4]:
data.loc[1]

'a'

In [5]:
data.iloc[1:3]

3    b
5    c
dtype: object

In [6]:
data.iloc[1]

'b'

In [2]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

* you can put an output table in a data frame by using the pd.dataframe() function

In [4]:
data.area == data['area']
data.area is data['area']

True

In [5]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [7]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [8]:
data.T #to transpose the data to contain the column and row names
#rearrange the values in a tabular matrix,by changing their respective rows and 
#column positional indicators.

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [12]:
data.iloc[:3, :2]
#defined by indexes or indices in the data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [16]:
data.loc[:'New York', :'pop']
#defined by obvious data description such as row and 
#column names

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

data.ix[:3, :'pop']
* The ix indexer allows a hybrid of these two approaches

In [15]:
data.loc[data.density > 100, ['pop', 'density']]
#in the loc indexer we can combine masking and 
#fancy indexing

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [17]:
data.iloc[0, 2] = 90
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [19]:
data[3:]

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [21]:
import numpy as np
import pandas as pd

In [24]:
rng = np.random.RandomState(42)
series = pd.Series(rng.randint(0, 10, 4))

In [25]:
series

0    6
1    3
2    7
3    4
dtype: int32

In [26]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [29]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')
density = population/area
density

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

* this has to do with index alignment in pandas seies. combining data from two different sources and computing it this way produces the union of the individual data

In [30]:
# ??? what is the function of this | operator?
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

### Handling missing values in pandas
* for example

In [31]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [32]:
print(A.add(B)) #same as A+B
print(A.add(B, fill_value=0))
#from the data, 0 will be added to [0],2  and 0 to [3]

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64
0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [33]:
#example 2
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB'))
A

   A   B
0  1  11
1  5   1

In [36]:
B = pd.DataFrame(rng.randint(0,10, (3,3)),
                columns= list('BAC'))
B

   B  A  C
0  4  0  9
1  5  8  0
2  9  2  6

In [37]:
A+B

      A     B   C
0   1.0  15.0 NaN
1  13.0   6.0 NaN
2   NaN   NaN NaN

In [41]:
#fill the missing values by stacking A and 
#fill in the mean values
fill = A.stack().mean()
A.add(B, fill_value = fill)
#we stack because: numPy boolean array indexing assignment 
#cannot assign 2 input values to the 5 output values where the mask is true

      A     B     C
0   1.0  15.0  13.5
1  13.0   6.0   4.5
2   6.5  13.5  10.5

In [2]:
import pandas as pd
import numpy as np

vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [3]:
#The use of Python objects in an array also means that if you perform aggregations
#like sum() or min() across an array with a None value, you will generally get an error
#e.g.

vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [2]:
vals2 = np.array([1, np.nan, 2, 3])
vals2
#output is in float form because NaN is 
#specifically a floating-point value

array([ 1., nan,  2.,  3.])

###### operating on null and missing values
* detecting: isnull() and notnull() - boolean results
* dropping null values and filling: dropna() and fillna()

In [4]:
data = pd.Series([1, np.nan, 'hello', None]) 
print(data.isnull())
print(data.notnull())
#checking the null values in the data

0    False
1     True
2    False
3     True
dtype: bool
0     True
1    False
2     True
3    False
dtype: bool

In [7]:
print(data.dropna())
print(data.fillna(data[0]))
#fillna requires a method or a commang on what to put into the missing values

0        1
2    hello
dtype: object
0        1
1        1
2    hello
3        1
dtype: object

In [2]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [3]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [4]:
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [5]:
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [6]:
data = {('California', 2000): 33871648, 
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}

In [7]:
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [8]:
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])
#where 'HR' is heart rate and 'Temp' is temperature

In [12]:
#generating some data
data = np.round(np.random.randn(4, 6), 1)
#roundup using numpy, random numbers in a 4 by 6 matrix 
#by 1 decimal place 
data[:, ::2] *= 10
data += 37

In [13]:
health_data = pd.DataFrame(data, index= index, columns= columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      46.0  36.2  38.0  37.5  37.0  37.1
     2      42.0  36.4  38.0  39.0  35.0  36.4
2014 1      26.0  35.7  54.0  36.6  28.0  35.4
     2      17.0  37.5  43.0  36.4  34.0  37.1

###### For complicated records containing multiple labeled measurements across multiple times for many subjects (people, countries, cities, etc.), use of hierarchical rows and columns can be extremely convenient!

In [15]:
health_data['Bob', "HR"]
#this shows Bob's heartrate for the 4 visits he had had at the hospital

year  visit
2013  1        46.0
      2        42.0
2014  1        26.0
      2        17.0
Name: (Bob, HR), dtype: float64

In [27]:
#from the health_data, show me the patient with the lowest temperature and 
#what year/number he visited
health_data['Bob','Temp'].min()

35.7

###### from the health data, give me the explicit variation(loc)by slicing the data and giving me all the rows that are of year 1 and slice the data by all the columns, returning the ones with HR alone.

In [28]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      46.0  38.0  37.0
2014 1      26.0  54.0  28.0

In [34]:
minimum_data= health_data.loc[idx[:, :], idx[:, 'HR']].min()
minimum_data
#check cell 27 for full Q

subject  type
Bob      HR      17.0
Guido    HR      38.0
Sue      HR      28.0
dtype: float64

In [33]:
minimum_data.min()

17.0

* i want my minimum_data final result to have the name of the patient, the visit number and the year but how?
?????

In [37]:
os = health_data.stack()

subject           Bob  Guido   Sue
year visit type
2013 1     HR    46.0   38.0  37.0
           Temp  36.2   37.5  37.1
     2     HR    42.0   38.0  35.0
           Temp  36.4   39.0  36.4
2014 1     HR    26.0   54.0  28.0
           Temp  35.7   36.6  35.4
     2     HR    17.0   43.0  34.0
           Temp  37.5   36.4  37.1

In [38]:
 health_data.unstack().stack()
#returns the data to its original data form

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      46.0  36.2  38.0  37.5  37.0  37.1
     2      42.0  36.4  38.0  39.0  35.0  36.4
2014 1      26.0  35.7  54.0  36.6  28.0  35.4
     2      17.0  37.5  43.0  36.4  34.0  37.1

* to compute the average heart rate and temperature among all the subjects in all visits each year:

In [40]:
#for the rows first
#to check the average compute of the two visits per year,
data_mean = health_data.mean(level='year')
data_mean

subject   Bob       Guido          Sue
type       HR  Temp    HR   Temp    HR   Temp
year
2013     44.0  36.3  38.0  38.25  36.0  36.75
2014     21.5  36.6  48.5  36.50  31.0  36.25

In [43]:
#including the mean among the columns as well, (horizontal)x=0, y=1
data_mean.mean(axis=1, level='type')

#if we tried axis=0, we'll get an error message because 
#there is no "type" observation in the row, only year&visit

type         HR   Temp
year
2013  39.333333  37.10
2014  33.666667  36.45

In [45]:
x = [1, 2, 3]
y = [4, 5, 6]
z = [7, 8, 9]
np.concatenate([x, y, z]) 
#this is a list or tuple of arrays to concat

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [46]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [50]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
print(df1); print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [51]:
pd.merge(df1,df2)
#joins the information in the dataframes to a single dataframe

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [52]:
pd.merge(df1,df2, on = 'employee')
#defines the key column in both dataframes

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [53]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
pd.merge(df1, df3, left_on ='employee', right_on = 'name')

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

now we can see that both employee and name have the same observations which makes one of them redundant.
this usually occurs when extracting data from different sources in the real world data. Due to this redundancy, we have to drop one of the columns

In [56]:
pd.merge(df1,df3, left_on = 'employee', right_on="name").drop('name', axis=1)
#drop name from the vertical axis or column

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [58]:
car_data = pd.DataFrame({'cars':['audi','bmw','toyota',
                              'volkswagen','volvo'],
                        'engine':['v6','v12','v8', 'v12','v16']})
print(car_data)

         cars engine
0        audi     v6
1         bmw    v12
2      toyota     v8
3  volkswagen    v12
4       volvo    v16

In [61]:
car_type = pd.DataFrame({'cars':['audi','bmw','toyota',
                                 'volkswagen','volvo'],
                        'year':['2007','2016','2012','2015','2020']})
print(car_type)

         cars  year
0        audi  2007
1         bmw  2016
2      toyota  2012
3  volkswagen  2015
4       volvo  2020

In [62]:
pd.merge(car_data,car_type)

         cars engine  year
0        audi     v6  2007
1         bmw    v12  2016
2      toyota     v8  2012
3  volkswagen    v12  2015
4       volvo    v16  2020

In [64]:
cumulative = pd.merge(car_data, car_type)

In [63]:
auto_price = pd.DataFrame({'name':["bmw",'audi','volvo', 'volkswagen','toyota'],
                          'price':[20000, 50000, 100000, 90000, 10000]})
print(auto_price)

         name   price
0         bmw   20000
1        audi   50000
2       volvo  100000
3  volkswagen   90000
4      toyota   10000

In [66]:
pd.merge(cumulative, auto_price, left_on ='cars', right_on='name' )

         cars engine  year        name   price
0        audi     v6  2007        audi   50000
1         bmw    v12  2016         bmw   20000
2      toyota     v8  2012      toyota   10000
3  volkswagen    v12  2015  volkswagen   90000
4       volvo    v16  2020       volvo  100000

In [68]:
pd.merge(cumulative, auto_price, left_on='cars', right_on='name').drop('name', axis=1)

         cars engine  year   price
0        audi     v6  2007   50000
1         bmw    v12  2016   20000
2      toyota     v8  2012   10000
3  volkswagen    v12  2015   90000
4       volvo    v16  2020  100000

Left and right key index words

In [71]:
cumulatives1 = car_data.set_index('cars')
cumulatives2 = car_type.set_index('cars')
print(cumulatives1); print(cumulatives2)

           engine
cars
audi           v6
bmw           v12
toyota         v8
volkswagen    v12
volvo         v16
            year
cars
audi        2007
bmw         2016
toyota      2012
volkswagen  2015
volvo       2020

In [73]:
#put it in a dataframe format
pd.merge(cumulatives1, cumulatives2, left_index=True, right_index= True)

           engine  year
cars
audi           v6  2007
bmw           v12  2016
toyota         v8  2012
volkswagen    v12  2015
volvo         v16  2020

In [74]:
#alternatively, for joining on indices
cumulatives1.join(cumulatives2)

           engine  year
cars
audi           v6  2007
bmw           v12  2016
toyota         v8  2012
volkswagen    v12  2015
volvo         v16  2020

In [76]:
pd.merge(cumulatives1, auto_price, left_index=True, right_on='name')
#this code gives me the liberty to choose which of the columns i want to keep using the "set_index" key words
#this is an alternative to the "on" keywords

  engine        name   price
1     v6        audi   50000
0    v12         bmw   20000
4     v8      toyota   10000
3    v12  volkswagen   90000
2    v16       volvo  100000

* intersections (inner joins), unions (outer joins)

In [79]:
#consider this
orders = pd.DataFrame({'names':['Jonas','Peace','Peter'],
                       'food':['turkey','plantain','spaghetti']},
                     columns=['names','food'])
welfare = pd.DataFrame({'names':['Jonas','Adeoti'],
                       'drinks':['water','juice']},
                      columns=['names','drinks'])
pd.merge(orders, welfare)
#this method automatically tales the intersection,the 
#innerjoin of both arrays or simply put, the details 
#of the ones that are common.

   names    food drinks
0  Jonas  turkey  water

In [81]:
#or explicitly,
pd.merge(orders, welfare, how='inner')

   names    food drinks
0  Jonas  turkey  water

In [82]:
#similarly, for the union of all the columns which will 
#also include some missing data:

pd.merge(orders, welfare, how='outer')

    names       food drinks
0   Jonas     turkey  water
1   Peace   plantain    NaN
2   Peter  spaghetti    NaN
3  Adeoti        NaN  juice

In [84]:
#let see for other keywords such as 'left', 'right'
pd.merge(orders, welfare, how='left')

   names       food drinks
0  Jonas     turkey  water
1  Peace   plantain    NaN
2  Peter  spaghetti    NaN

In [85]:
pd.merge(orders, welfare, how='right')

    names    food drinks
0   Jonas  turkey  water
1  Adeoti     NaN  juice

In [86]:
war1 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                     'rank': [1, 2, 3, 4]})
war2 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                     'rank': [3, 1, 4, 2]})
pd.merge(war1, war2, on='name')

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

* this method or built in function acts smartly by automatically making conflicting columns, unique by adding x and y
* but we can specify what we want the unique suffixes to be represented as, let's see below:

In [89]:
pd.merge(war1, war2, on='name', suffixes= ['_L','_R'])

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [92]:
population =pd.read_csv('state-population.csv')
areas= pd.read_csv('state-areas.csv')
abbrevs = pd.read_csv('state-abbrevs.csv')

print(population.head())
print(areas.head())
print(abbrevs.head())

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [103]:
pd.merge(population, abbrevs, how='outer', left_index = True, right_index= True).head(2)
#this uses the index to merge the abbreviated 'state/region' column with the 
#'abbreviation' column. Though it gives us an output,
#it is a wrong output because the indexes clarify the program on taking
#both tables but not on arranging the states/region
#according to their abbrevs. thats why AL is represented as AK below
#Alaska, instead of Alabama.

  state/region     ages  year  population    state abbreviation
0           AL  under18  2012   1117489.0  Alabama           AL
1           AL    total  2012   4817528.0   Alaska           AK

* also it is noteworthy that if we use the how='outer' because pd.merge() automatically takes the inner join of tables and between the population and abbrevs table, the abbreviations are common but are only representative meanings of the states and they'd both be taken on the 50 observations in the abbrevs table. instead of the actual 2544 obervations in the popn data

In [107]:
#Now take a look at this.
merged= pd.merge(population, abbrevs, how='outer', left_on='state/region', right_on= 'abbreviation')
#Alabama is aptly represent and the others are too

In [108]:
merged = merged.drop('abbreviation', axis=1)
merged.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [110]:
#check for duplicates and null values
sum(merged.duplicated())

0

In [113]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [114]:
merged.isnull().sum()

state/region     0
ages             0
year             0
population      20
state           96
dtype: int64

In [118]:
merged[merged['population'].isnull()].head()

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [121]:
merged.loc[merged['state'].isnull(),'state/region'].unique()
#check the unique 'state' that is null and its representative 
#in the state/region aspect

array(['PR', 'USA'], dtype=object)

In [122]:
merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico'
merged.loc[merged['state/region'] == 'USA', 'state'] = 'United States'
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [128]:
final = pd.merge(merged, areas, on='state', how= 'left')
#this attaches the data based on the number of observations/features in
#the merged data instead of the ones on the areas column
#the areas column has some missing data for some observations in the merged data

In [129]:
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [130]:
#let's check for any null values 
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [131]:
#to check for how many null values are there...
final.isnull().sum()

state/region      0
ages              0
year              0
population       20
state             0
area (sq. mi)    48
dtype: int64

In [132]:
final[final['population'].isnull()].head()

     state/region     ages  year  population        state  area (sq. mi)
2448           PR  under18  1990         NaN  Puerto Rico         3515.0
2449           PR    total  1990         NaN  Puerto Rico         3515.0
2450           PR    total  1991         NaN  Puerto Rico         3515.0
2451           PR  under18  1991         NaN  Puerto Rico         3515.0
2452           PR    total  1993         NaN  Puerto Rico         3515.0

In [137]:
final[final['area (sq. mi)'].isnull()].head()

     state/region     ages  year   population          state  area (sq. mi)
2496          USA  under18  1990   64218512.0  United States            NaN
2497          USA    total  1990  249622814.0  United States            NaN
2498          USA    total  1991  252980942.0  United States            NaN
2499          USA  under18  1991   65313018.0  United States            NaN
2500          USA  under18  1992   66509177.0  United States            NaN

In [141]:
final['state'][final['area (sq. mi)'].isnull()].unique()\
#to check ehat state has missing values

array(['United States'], dtype=object)

In [142]:
final.dropna(inplace=True)
#dropping those rows

In [143]:
final

     state/region     ages  year  population        state  area (sq. mi)
0              AL  under18  2012   1117489.0      Alabama        52423.0
1              AL    total  2012   4817528.0      Alabama        52423.0
2              AL  under18  2010   1130966.0      Alabama        52423.0
3              AL    total  2010   4785570.0      Alabama        52423.0
4              AL  under18  2011   1125763.0      Alabama        52423.0
...           ...      ...   ...         ...          ...            ...
2491           PR  under18  2010    896945.0  Puerto Rico         3515.0
2492           PR  under18  2011    869327.0  Puerto Rico         3515.0
2493           PR    total  2011   3686580.0  Puerto Rico         3515.0
2494           PR  under18  2012    841740.0  Puerto Rico         3515.0
2495           PR    total  2012   3651545.0  Puerto Rico         3515.0

[2476 rows x 6 columns]

In [146]:
data2010 = final.query("year == 2010 & ages == 'total'")
data2010.head()

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama        52423.0
91            AK  total  2010    713868.0      Alaska       656425.0
101           AZ  total  2010   6408790.0     Arizona       114006.0
189           AR  total  2010   2922280.0    Arkansas        53182.0
197           CA  total  2010  37333601.0  California       163707.0

In [147]:
#setting the state as the primary key
data2010.set_index('state', inplace=True)
density = data2010['population'] / data2010['area (sq. mi)']

In [148]:
density.sort_values(ascending=False, inplace=True)
density.head()

state
District of Columbia    8898.897059
Puerto Rico             1058.665149
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
dtype: float64

In [149]:
density.tail()

state
South Dakota    10.583512
North Dakota     9.537565
Montana          6.736171
Wyoming          5.768079
Alaska           1.087509
dtype: float64

In [14]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [15]:
planets.shape

(1035, 6)

In [16]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [2]:
import pandas as pd

In [4]:
df = pd.DataFrame({'key':['A','B','C','A','B','C'],
                  'data': range(6)}, columns=['key','data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [5]:
df.groupby('key')
#returns a DataFrameGroupBy object

In [6]:
df.groupby('key').count()

     data
key
A       2
B       2
C       2

In [13]:
df.groupby('key').sum()
#virtually any kind of aggregate function in pandas or numpy 
#can be applied here

     data
key
A     1.5
B     1.5
C     1.5

In [17]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [18]:
planets.groupby('method')['year'].describe().unstack()

       method
count  Astrometry                          2.0
       Eclipse Timing Variations           9.0
       Imaging                            38.0
       Microlensing                       23.0
       Orbital Brightness Modulation       3.0
                                         ...
max    Pulsar Timing                    2011.0
       Pulsation Timing Variations      2007.0
       Radial Velocity                  2014.0
       Transit                          2014.0
       Transit Timing Variations        2014.0
Length: 80, dtype: float64

In [19]:
pd.options.display.max_rows= 4000

In [22]:
planets.groupby('method')['year'].describe().unstack()

       method
count  Astrometry                          2.000000
       Eclipse Timing Variations           9.000000
       Imaging                            38.000000
       Microlensing                       23.000000
       Orbital Brightness Modulation       3.000000
       Pulsar Timing                       5.000000
       Pulsation Timing Variations         1.000000
       Radial Velocity                   553.000000
       Transit                           397.000000
       Transit Timing Variations           4.000000
mean   Astrometry                       2011.500000
       Eclipse Timing Variations        2010.000000
       Imaging                          2009.131579
       Microlensing                     2009.782609
       Orbital Brightness Modulation    2011.666667
       Pulsar Timing                    1998.400000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2007.518987
       Transit                          2011.236776
       Transit Timing Variations        2012.500000
std    Astrometry                          2.121320
       Eclipse Timing Variations           1.414214
       Imaging                             2.781901
       Microlensing                        2.859697
       Orbital Brightness Modulation       1.154701
       Pulsar Timing                       8.384510
       Pulsation Timing Variations              NaN
       Radial Velocity                     4.249052
       Transit                             2.077867
       Transit Timing Variations           1.290994
min    Astrometry                       2010.000000
       Eclipse Timing Variations        2008.000000
       Imaging                          2004.000000
       Microlensing                     2004.000000
       Orbital Brightness Modulation    2011.000000
       Pulsar Timing                    1992.000000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  1989.000000
       Transit                          2002.000000
       Transit Timing Variations        2011.000000
25%    Astrometry                       2010.750000
       Eclipse Timing Variations        2009.000000
       Imaging                          2008.000000
       Microlensing                     2008.000000
       Orbital Brightness Modulation    2011.000000
       Pulsar Timing                    1992.000000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2005.000000
       Transit                          2010.000000
       Transit Timing Variations        2011.750000
50%    Astrometry                       2011.500000
       Eclipse Timing Variations        2010.000000
       Imaging                          2009.000000
       Microlensing                     2010.000000
       Orbital Brightness Modulation    2011.000000
       Pulsar Timing                    1994.000000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2009.000000
       Transit                          2012.000000
       Transit Timing Variations        2012.500000
75%    Astrometry                       2012.250000
       Eclipse Timing Variations        2011.000000
       Imaging                          2011.000000
       Microlensing                     2012.000000
       Orbital Brightness Modulation    2012.000000
       Pulsar Timing                    2003.000000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2011.000000
       Transit                          2013.000000
       Transit Timing Variations        2013.250000
max    Astrometry                       2013.000000
       Eclipse Timing Variations        2012.000000
       Imaging                          2013.000000
       Microlensing                     2013.000000
       Orbital Brightness Modulation    2013.000000
       Pulsar Timing                    2011.000000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2014.000000
       Transit                          2014.000000
       Transit Timing Variations        2014.000000
dtype: float64

In [30]:
import numpy as np
df.groupby('key').aggregate([min,np.median, max])

    data
     min median max
key
A      0    1.5   3
B      1    2.5   4
C      2    3.5   5

In [34]:
df.groupby('key').transform(lambda x: x - x.mean())

   data
0  -1.5
1  -1.5
2  -1.5
3   1.5
4   1.5
5   1.5